// pages/about/about.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    aboutList: [
      { title: '队伍信息', detail: '“昨日书屋”创业团队贯彻理念：发展从学生中来，服务从学生中去。团队成员成员具有很高的创业素质、创业激情与创业经验。均为大学本科在读学生，我们团队分工明确，分小组分别负责市场宣传、技术开发、服务管理。各小组各司其职，分工协作。' },
      {
        title: '社会关怀', detail: '坚持节约资源和保护环境是我国的基本国策，关系到人们群众切身利益和中华民族的生存发展。我国经济社会的发展已经进入新的历史阶段，建设“资源节约型，环境友好型”社会迫在眉睫。切实保护和合理利用各种资源，提高资源的利用率，具有全局性和战略性的重大决策。建立学校的二手书交易市场不仅响应了国家提出的“建设资源节约型，环境友好型社会”的号召，而且体现了中华民族勤俭节约的传统美德。旧书的循环利用可以减轻学生的经济负担，更重要的是提高了书籍循环的利用率的同时也降低了能源的消耗，减少了废水、废气的排放，真正的做到了绿色环保。随着经济的快速发展，人们的生活水平逐渐提高，人们的环保意识也日趋增强。实施二手书的交易可以使得环保节约意识深入校园，在我们要长期生活的大学校园形成一种保护环境，节约资源的氛围。' },
      { title: '勤工俭学', detail: '昨日书屋的创立为我校贫困生提供了众多的勤工俭学岗位，为同学们在学校中更好的生活提供了一定的保障。并且定期为勤工俭学的同学们提供一定的生活物资。' },
    ],
    
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})